# Используем официальный образ Golang как базовый
FROM golang:1.23.3 AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем go.mod и go.sum перед копированием исходного кода для кэширования зависимостей
COPY go.mod go.sum ./
RUN go mod download

# Копируем остальные файлы исходного кода
COPY . .

# Собираем приложение, указав путь к исполняемому файлу
RUN go build -o myapp ./cmd/main.go

# Используем более легкий образ для выполнения приложения
FROM alpine:latest

# Устанавливаем необходимые библиотеки
RUN apk --no-cache add ca-certificates

# Открываем порт для приложения
EXPOSE 8080

# Устанавливаем рабочую директорию
WORKDIR /root/

# Копируем исполняемый файл из первого этапа
COPY --from=builder /app/myapp .

# Указываем команду запуска контейнера
CMD ["./myapp"]